Here is the terraform plan for adding the athena workgroup:
```
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.workgroup.aws_athena_workgroup.main will be created
  + resource "aws_athena_workgroup" "main" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "bcda"
      + state         = "ENABLED"
      + tags          = {
          + "application" = "bfd-insights"
          + "business"    = "OEDA"
          + "project"     = "bcda"
        }

      + configuration {
          + enforce_workgroup_configuration    = true
          + publish_cloudwatch_metrics_enabled = true

          + result_configuration {
              + output_location = "s3://bfd-insights-bcda-577373831711/workgroups/bcda/"

              + encryption_configuration {
                  + encryption_option = "SSE_KMS"
                  + kms_key_arn       = "arn:aws:kms:us-east-1:577373831711:key/a4ca59d6-3978-434b-9a5c-c6ae8896db18"
                }
            }
        }
    }

  # module.workgroup.aws_s3_bucket_object.folder will be created
  + resource "aws_s3_bucket_object" "folder" {
      + acl                    = "private"
      + bucket                 = "bfd-insights-bcda-577373831711"
      + content_type           = "application/x-directory"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "workgroups/bcda/"
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + version_id             = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```